[
  {
    "Id": "167799",
    "ThreadId": "50128",
    "Html": "Hi everybody! here's a message I received today:<br>\r\n<br>\r\n<blockquote dir=ltr style=\"margin-right:0px\">\r\n<p dir=ltr style=\"margin:0in 0in 0pt\"><span><em>I cannot but disagree with the statement on the Irony homepage on CodePlex, &quot;a completely new ... technology of compiler construction.&quot;<br>\r\n<br>\r\nThe two main new features of Irony seem to be a) code-embedded grammar definition using operator overloading and b) run-time parse table generation.<br>\r\n<br>\r\nGrammatica (</em><a href=\"http://grammatica.percederberg.net/\"><em>http://grammatica.percederberg.net/</em></a><em>) by Per Cederberg is an LL(k) parser generator that does b) since 2003. The code generated by Grammatica looks similar to Irony's, doing code-embedded grammar definition using standard method calls, if you will. But, having the grammar clean of any implementation-language clutter seems far more beneficial to me than the savings from not having to run the parser generator now or again.<br>\r\n<br>\r\nOther than that, it took me just a day or so to build a version the reads a grammar, builds the parse table for it, and parses a source program, all in one run, no code generation necessary at all.<br>\r\n<br>\r\nBecause Grammatica doesn't actually advertise its run-time parse table generation, this may not be well known. Nonetheless, may I ask you to revise the statement made on the Irony homepage?<br>\r\n<br>\r\n<br>\r\n</em>Any opinions? Anybody worked with Grammatica before?<br>\r\nFor my part, I wouldn't fight to death on matters of novelty - I'm not applying for patent and arguing the case with patent expert. I think I just did something that is a NEW Recombination of pretty old ideas and existing technologies (operator overloading - what's new?!!!) . As we all know, nothing is new under this old sky...<br>\r\nOpinions, comments? Should I change the home page to say &quot;.. oh, it's just Yet Another mix of old crap...-)))&quot;?<br>\r\n<br>\r\nTruly yours - Roman<br>\r\n</span></p>\r\n</blockquote>\r\n",
    "PostedDate": "2009-03-13T08:45:11.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167921",
    "ThreadId": "50128",
    "Html": "Well, I'm not sure how Grammatica works when using the run-time parse table generator, but it won't hurt to use the &quot;new&quot; word I guess. Everybody always uses it to promote their products. In fact, every product is &quot;new&quot; and unique, so why not let it stay?<br>\r\nSo maybe the runtime generation is not new, but Irony is. End of story, let it stay. :)<br>\r\n",
    "PostedDate": "2009-03-13T14:07:55.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168870",
    "ThreadId": "50128",
    "Html": "I think the great work you have done is a proof for the people which stick into .net framework and all its features.<br>\r\nIrony is actually unique. I would like to vote it to be the part of .net framework in the future.\r\n",
    "PostedDate": "2009-03-16T20:16:56.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "169005",
    "ThreadId": "50128",
    "Html": "Well, while it can be argued which method (Irony or Grammatica) is &quot;better&quot; (which is largely what he is doing in his email), it's quite clear that the methods are <em>different</em>.&nbsp; And that&nbsp; Grammatica's method is the more traditional (or, if you will, &quot;older&quot;) style.&nbsp; <br>\r\n<br>\r\nHowever, I would nevertheless question&nbsp; if Irony can be called &quot;completely new&quot;, when it is rather similar to the way Spirit (from the Boost C++ library; <a href=\"http://www.boost.org/doc/libs/1_38_0/libs/spirit/classic/index.html\">http://www.boost.org/doc/libs/1_38_0/libs/spirit/classic/index.html</a>) does it.<br>\r\n",
    "PostedDate": "2009-03-17T06:55:42.993-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "172990",
    "ThreadId": "50128",
    "Html": "Seems like a silly thing for someone to complain about!?!?&nbsp; Why worry about the semantics of how something is presented?&nbsp; I am more worried about how something actually works!<br>\r\n<br>\r\nIn the correct context everything is new, but in another context nothing is new...<br>\r\n<br>\r\n<blockquote>What has been will be again, what has been done will be done again; there is nothing new under the sun. <br>\r\nIs there anything of which one can say, &quot;Look! This is something new&quot;? It was here already, long ago; it was here before our time&quot;<br>\r\n<br>\r\n</blockquote>My vote is to leave it be and ignore the flamers that want to take value and not add value! \r\n",
    "PostedDate": "2009-03-27T19:00:47.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]