[
  {
    "Id": "191227",
    "ThreadId": "56587",
    "Html": "<p>Hello,</p>\r\n<p>My way to Irony is quite stony:</p>\r\n<p>i found Irony through Ben Morrison's CodeProject essay, downloaded it, tried some things that didn't work (my current goal is a MIPS Simulator in C#).</p>\r\n<p>Then&nbsp;I found Your CodeProject essay, downloaded those sources, tried again - new errors.</p>\r\n<p>finally, I followed the small link to this CodePlex Project, updated my sources, and found new errors.</p>\r\n<p>The Core of the question is: what happens to my changes when you release your next results.</p>\r\n<p>Example: Running the GrammarExplorer in the current release failed due to the known missing-Grammar-Settings bug, so i deleted the ComboBox'Items, and it worked.</p>\r\n<p>When I then opened the Samples dll, some of the Items were checked, but most weren't. Seemed strange. a little debugging leaded me to the source: When adding the grammars from the assembly, you always select the last Item in the ListBox of the dialog. But the listbox is ordered alphabetically, so as soon as a language starting with, say, a Z is added, all the other (dictionary-orderedly smaller)languages aren't selected.</p>\r\n<p>Again, if I&nbsp;fix that (rather unimportant, I know, but it`s an example) bug, how can I be sure, that it helps the project.</p>\r\n<p>Another aspect: while studying your sources, and understanding more and more of the context, I could add /// &lt;summary&gt; comments to the classes, so that the gap between non-documented and perfectly-documented shrinks. But if there is no possibility to commit, what would it use? (I guess, that is not a sentence you can say in english... sounds not well.)</p>\r\n<p>It would be great if I could help (and surely, others would like to, too), because the project seems really great.</p>\r\n<p>Please let us.</p>\r\n<p>with kind regards,</p>\r\n<p>Alex</p>",
    "PostedDate": "2009-05-17T11:56:10.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191343",
    "ThreadId": "56587",
    "Html": "<p>I do agree that Irony's roadmap is quite &quot;stony&quot;, and landscape is quite fragmented -&nbsp;published articles and code don't work with latest version. Irony continues to evolve, that's why it is still in alpha (not feature-complete); sorry, it's just nature of development.</p>\r\n<p>I hope as soon as I bring the current source up-to-date - restore all functionality that was working in alpha-zip in Downloads page - it will be moved to beta stage, meaning public interfaces would freeze. As soon as it happens, I will go through&nbsp;some published code and fix it to work with beta version, and re-publish it (either here or in original publications). That would also be the time to start xml-comments,&nbsp;with intent to produce&nbsp;help file and some guide/documentation. I would welcome help with this.</p>\r\n<p>As for bugs and how to you can help to fix them - there's already a way to do so. Just open an item on &quot;Issue tracker&quot; page, explain the bug, attach a patch file, and I will put the fix into the next code drop. I'm doing this already on routine basis,&nbsp;guys like you submit fixes and&nbsp;I put them in place.&nbsp;The problem with directly allowing many people to do bug fixes is again the same -&nbsp;the code evolves, and sometimes troubles go away as part of bigger refactorings, sometimes&nbsp;the code gets moved and it's not there anymore. So it's better if I apply the patch.</p>\r\n<p>If you want to contribute on a bigger scale, not just bug fixes&nbsp;- let's discuss it..</p>\r\n<p>Thank you</p>\r\n<p>Roman&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-18T00:08:09.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]